{
  "theme": {
    "light": "light",
    "dark": "dark",
    "system": "system"
  },
  "languages": {
    "tr": "Türkçe",
    "en": "English"
  },
  "Menu": {
    "menu": "Menu",
    "home": "Home",
    "about": "About",
    "services": "Services",
    "blogs": "Blogs",
    "contact": "Contact"
  },
  "HomePage": {
    "recap": {
      "A Quick Recap": "A Quick Recap",
      "summaryText": "With 4 years of software experience and over 2 years of professional work experience, I am a <strong>full-stack developer</strong>. I have professional-level expertise in <strong>JavaScript</strong> and <strong>TypeScript</strong>. Currently, I am developing my experiences using <strong>Next</strong> and <strong>Node</strong>.",
      "learnMore": "Learn more"
    },
    "experiences": {
      "title": "Experiences",
      "text": "As a full-stack developer, I've successfully <strong>developed over 10 projects</strong>. I have experience in many different fields. Here are some of my experiences.",
      "landingWebPageTitle": "Promotional Websites",
      "landingWebPage": "Unique websites for different companies. In these experiences, I have try to make interestring and user-friendly designs.",
      "webpToApplicationTitle": "Web to Application",
      "webpToApplication": "That takes users from a web page to a mobile application. After registering, users can log in to the application and start using the service.",
      "ecommerceTitle": "E-commerce",
      "ecommerceText": "E-commerce webapplication for a global company that sells products to the USA, UK, Germany, France, Italy, Spain, and other countries.",
      "servicesText": "I provide professional services on these fields. Further details you can look my services.",
      "services": "Services"
    },
    "contact": {
      "title": "Do you like what you've seen so far?",
      "text": "I'm always excited to connect! Whether you have a project in mind, want to collaborate, or just want to chat about tech, feel free to reach out. Let's explore how we can create something amazing together.",
      "getInTouchNow": "Get in touch now"
    }
  },
  "AboutPage": {
    "recap": {
      "webEnthusiast": "Web Enthusiast",
      "lifelongLearner": "Lifelong Learner",
      "summary": "<p>As a graduate of the Computer Engineering program at <strong>Ted University</strong>, I have focused my career on software development. During my education, I completed two long-term internships; the first was at <strong>Altima</strong>, and the second was at <strong>Osi</strong>. Following my internships, I worked at <strong>Osi</strong> as a <strong>full-stack developer</strong> for over 2 years, contributing to significant experiences during that time.</p> <p>Currently, I am working at <strong>Oak Technology</strong> as a <strong>front-end developer</strong>, where I leverage modern technologies to develop user-focused solutions.</p>",
      "title2": "Focuses Right Now",
      "description2": "<p>Throughout my career in software development, I have taken on significant responsibilities in <strong>front-end</strong>, <strong>back-end</strong>, and <strong>SEO</strong>. With the experience gained from these projects, I have developed <strong>user-friendly websites</strong> and <strong>high-performance applications</strong>. I closely follow <strong>modern software technologies</strong> and implement the latest and best solutions in all my projects.</p> <p>My goal is to create <strong>high-quality and sustainable</strong> projects that best meet my clients' needs. I continue to grow and learn with each new project.</p>",
      "servicesText": "<p>I give professional services on <strong>front-end</strong>, <strong>back-end</strong>, <strong>SEO</strong> and more. You can look my services.</p>",
      "services": "Services"
    }
  },
  "ContactPage": {
    "title": "Get in Touch",
    "description": "Feel free to reach out! Whether you have questions, feedback, or need assistance, I'm here to help. Send me a message, and I'll get back to you as soon as possible.",
    "form": {
      "name": {
        "label": "Name",
        "placeholder": "Your name"
      },
      "email": {
        "label": "Email",
        "placeholder": "your@email.com"
      },
      "subject": {
        "label": "Subject",
        "placeholder": "Message subject"
      },
      "message": {
        "label": "Message",
        "placeholder": "Your message here..."
      },
      "submit": {
        "sending": "Sending...",
        "send": "Send Message"
      },
      "success": "Message sent successfully!",
      "error": "Failed to send message. Please try again.",
      "validation": {
        "name": "Name must be at least 2 characters",
        "email": "Invalid email address",
        "subject": "Subject must be at least 3 characters",
        "message": "Message must be at least 10 characters",
        "recaptcha": "ReCaptcha verification failed"
      }
    }
  },
  "Blog": {
    "title": "Blog",
    "description": "Welcome to my blog! Here, I share my thoughts, experiences, and learnings about web development and technology. Whether you're a fellow developer or just curious about what I'm up to, you're in the right place.",
    "share": "Share this post",
    "backToBlogs": "Back to blogs",
    "totalBlogs": "{count} articles in total",
    "postsPerPage": "Posts per page",
    "invalidUrl": "Invalid page or posts per page value. Redirecting to valid page.",
    "invalidUrlFormat": "Page and posts per page must be numbers. Redirecting to first page.",
    "sortBy": "Sort by",
    "newest": "Newest First",
    "oldest": "Oldest First",
    "category": "Category",
    "categories": {
      "all": "All Categories",
      "nextjs": "Next",
      "reactjs": "React",
      "typescript": "TypeScript",
      "javascript": "JavaScript"
    }
  },
  "Services": {
    "title": "Services",
    "description": "I offer comprehensive web development solutions including front-end design, back-end development, and SEO optimization. With extensive experience across modern technologies, I can help bring your digital vision to life. Explore my tech stack below to see the tools and frameworks I use to create powerful, efficient solutions.",
    "techStack": {
      "title": "Tech Stack",
      "description": "As a full-stack developer, I use a lot of libraries, tools etc. Here are the ones I use most.",
      "all": "All",
      "frontEnd": "Front-End",
      "backEnd": "Back-End",
      "other": "Other",
      "visitContact": "Are you ready to start your project? Let's talk about it.",
      "contact": "Contact"
    }
  },
  "footer": {
    "pages": "Pages",
    "home": "Home",
    "about": "About",
    "services": "Services",
    "blogs": "Blogs",
    "contact": "Contact",
    "socialMedia": "Social Media"
  }
}
