{
  "theme": {
    "light": "light",
    "dark": "dark",
    "system": "system"
  },
  "languages": {
    "tr": "Türkçe",
    "en": "English"
  },
  "Menu": {
    "menu": "Menu",
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "blogs": "Blogs",
    "contact": "Contact"
  },
  "HomePage": {
    "recap": {
      "A Quick Recap": "A Quick Recap",
      "summaryText": "With 4 years of software experience and over 2 years of professional work experience, I am a <strong>full-stack developer</strong>. I have professional-level expertise in <strong>JavaScript</strong> and <strong>TypeScript</strong>. Currently, I am developing my projects using <strong>Next</strong> and <strong>Node</strong>.",
      "learnMore": "Learn more"
    },
    "projects": {
      "Projects": "Highlighted Projects",
      "text": "As a full-stack developer, I've successfully <strong>developed over 10 projects</strong>, showcasing my expertise across the entire stack. Here are three standout projects",
      "allProjects": "All projects",
      "tripyText": "Tripy enhances the bicycle-sharing experience with modern technology. Tripy ensures every ride is both comfortable and enjoyable. Whether commuting or exploring, experience effortless journeys with our shared electric bikes.",
      "enerjeyText": "Enerjey is a multilingual corporate website. On this site, which I developed based on the Adobe XD design, we aimed to artistically convey the client`s corporate language.",
      "nanografiText": "Nanografi is a comprehensive e-commerce platform that sells chemical materials worldwide and supports multiple currencies."
    },
    "contact": {
      "title": "Do you like what you've seen so far?",
      "text": "I'm always excited to connect! Whether you have a project in mind, want to collaborate, or just want to chat about tech, feel free to reach out. Let's explore how we can create something amazing together.",
      "getInTouchNow": "Get in touch now"
    }
  },
  "AboutPage": {
    "recap": {
      "webEnthusiast": "Web Enthusiast",
      "lifelongLearner": "Lifelong Learner",
      "summary": "<p>As a graduate of the Computer Engineering program at <strong>Ted University</strong>, I have focused my career on software development. During my education, I completed two long-term internships; the first was at <strong>Altima</strong>, and the second was at <strong>Osi</strong>. Following my internships, I worked at <strong>Osi</strong> as a <strong>full-stack developer</strong> for over 2 years, contributing to significant projects during that time.</p> <p>Currently, I am working at <strong>Oak Technology</strong> as a <strong>frontend developer</strong>, where I leverage modern technologies to develop user-focused solutions.</p>"
    },
    "techStack": {
      "title": "Tech Stack",
      "description": "As a full-stack developer, I use a lot of libraries, tools etc. Here are the ones I use most.",
      "all": "All",
      "frontEnd": "Front-End",
      "backEnd": "Back-End",
      "other": "Other",
      "visitProjects": "Check out my projects where I use these technologies.",
      "allProjects": "All projects"
    }
  },
  "footer": {
    "pages": "Pages",
    "home": "Home",
    "about": "About",
    "projects": "Projects",
    "blogs": "Blogs",
    "contact": "Contact",
    "socialMedia": "Social Media"
  }
}
