{
  "theme": {
    "light": "açık",
    "dark": "koyu",
    "system": "sistem"
  },
  "languages": {
    "tr": "Türkçe",
    "en": "English"
  },
  "Menu": {
    "menu": "Menü",
    "home": "Anasayfa",
    "about": "Hakkımda",
    "projects": "Projeler",
    "blogs": "Bloglar",
    "contact": "İletişim"
  },
  "HomePage": {
    "recap": {
      "A Quick Recap": "Kısa Bir Özet",
      "summaryText": "4 yıllık yazılım deneyimim ve 2 yılı aşkın profesyonel çalışma geçmişimle bir <strong>full-stack developer</strong> olarak kariyerime devam ediyorum. <strong>JavaScript</strong> ve <strong>TypeScript</strong> konularında derin bir bilgi birikimine sahibim. Şu anda projelerimi <strong>Next.js</strong> ve <strong>Node.js</strong> ile geliştiriyorum.",
      "learnMore": "Daha fazlası"
    },
    "projects": {
      "Projects": "Öne Çıkarılan Projeler",
      "text": "Full-stack developer olarak, <strong>10'dan fazla projede baştan sona yer alarak</strong>, hem front-end hem de back-end becerilerimi geliştirme fırsatı buldum. Aşağıda size en sevdiğim üç projeyi bırakıyorum.",
      "allProjects": "Tüm projeler",
      "tripyText": "Tripy ile elektrikli bisikletleri paylaşarak kolayca ve keyifle istediğin yere ulaşabilirsin. Hem çevreye duyarlı, hem de pratik bir ulaşım seçeneği.",
      "enerjeyText": "Enerjey, çok dilli bir kurumsal web sitesidir. Adobe XD tasarımına dayanarak geliştirdiğim bu sitede, müşterinin kurumsal dilini sanatsal bir şekilde aktarmayı hedefledik.",
      "nanografiText": "Nanografi, dünya çapında kimyasal malzeme satan ve çoklu para birimini destekleyen kapsamlı bir e-ticaret platformudur."
    },
    "contact": {
      "title": "Gördüklerinizi beğendiniz mi?",
      "text": "Buraya kadar kaydırdıysanız ilginizi az da olsa çekebilmişim demektir. Eğer bu tarz minimal bir websitesi istiyorsanız benimle iletişim kurabilirsiniz.",
      "getInTouchNow": "İletişime geç"
    }
  },
  "AboutPage": {
    "recap": {
      "webEnthusiast": "Web Meraklısı",
      "lifelongLearner": "Araştırmacı",
      "summary": "<p>Ted Üniversitesi bilgisayar mühendisliği mezunu olarak, kariyerime yazılım alanında odaklanarak yön verdim. Eğitim sürecimde iki uzun dönem staj deneyimi edindim; bunlardan ilki <strong>Altima</strong>, diğeri ise <strong>Osi</strong> şirketinde gerçekleşti. Stajlarımın ardından, <strong>Osi</strong> bünyesinde <strong>full-stack developer</strong> olarak 2 yılı aşkın bir süre görev yaptım ve bu süreçte önemli projelerde yer aldım.</p><p>Şu anda <strong>Oak Technology</strong> şirketinde <strong>frontend developer</strong> olarak çalışıyor ve modern teknolojileri kullanarak kullanıcı odaklı çözümler geliştiriyorum.</p>"
    },
    "techStack": {
      "title": "Tech Stack",
      "description": "Full-Stack Developer olarak en çok kullandığım kütüphaneleri, araçları vb. aşağıda görebilirsiniz.",
      "all": "Tümü",
      "frontEnd": "Front-End",
      "backEnd": "Back-End",
      "other": "Diğer",
      "visitProjects": "Bunları hangi projelerde nasıl kulladığımı görün.",
      "allProjects": "Tüm projeler"
    }
  },
  "footer": {
    "pages": "Sayfalar",
    "home": "Anasayfa",
    "about": "Hakkımda",
    "projects": "Projeler",
    "blogs": "Bloglar",
    "contact": "İletişim",
    "socialMedia": "Sosyal Medya"
  }
}
